if __name__ == "__main__":
    print("Zdorov")
    #Завдання: Розробіть програму магазину, яка дозволить користувачу вибирати та купувати товари з використанням циклів та умов в мові програмування Python.
    ## Вимоги до програми: Створіть словник products, що містить назви товарів та їх ціни. Додайте принаймні 5 різних товарів.
    ## Створіть зміну balance з початковим значенням балансу покупця (наприклад, 100 грн).
    ## Створіть пустий список shopping_cart для зберігання придбаних товарів.
    ## Запустіть цикл, який продовжуватиме працювати, доки на рахунку є гроші.
    ## У циклі виводьте на екран доступні товари з їх цінами, використовуючи цикл for.
    ## Використовуйте метод items() для перебору елементів словника products.
    ## Запитайте користувача, який товар він хоче придбати, з використанням функції input().
    ## Перевірте, чи користувач ввів "q" (або будь-який інший символ) для виходу з програми.
    ## Якщо так, зупиніть цикл. Перевірте, чи обраний товар є в словнику products.
    ## Якщо так, перейдіть до наступного кроку. Якщо ні, виведіть повідомлення "Товар не знайдено" та поверніться до кроку 6.
    ## Перевірте, чи на рахунку є достатньо грошей для покупки вибраного товару.
    ## Якщо так, виконайте наступні дії: Зменшіть баланс покупця на вартість товару.
    ## Додайте назву товару до списку shopping_cart. Виведіть повідомлення "Товар додано до кошика". Поверніться до кроку 6.
    ## Якщо на рахунку недостатньо грошей для покупки вибраного товару, виведіть повідомлення "Недостатньо коштів на рахунку" та поверніться до кроку 6.
    ## Після завершення циклу покупок, виведіть список придбаних товарів зі списку shopping_cart.
    ## Виведіть залишок на рахунку після здійснення покупок.
    # Додаткові вимоги: Забезпечте, щоб програма була добре організована, з використанням функцій, які виконують конкретні завдання.
    ## Перевірте коректність введення користувача, ураховуючи можливі помилки.
    ## Надайте можливість користувачу вводити бажану кількість товару для купівлі.
    ## Додайте функцію розрахунку загальної вартості покупок.
    ## Це завдання дозволяє студентам відпрацювати роботу зі словниками, циклами, умовними операторами та функціями в Python.
    ## Вони повинні розробити програму, яка дозволяє користувачу купувати товари, оброблює помилки та виводить результати покупок.

    #Функція яка показує замовлення
    def print_order(cart):
        if cart:
            print("\nВаше замовлення:")
            total_purchase = 0
            for order in cart:
                print(
                    f"Назва: {order['Nome']}, Ціна за одиницю: {order['Costo per unità']}, Кількість: {order['Quantita']}, Вартість: {order['Totale']}")
                total_purchase += order['Totale']
            print(f"Загальна сума: {total_purchase}")
            print(f"Ваш залишок: {balance}")
            print("Дякуємо за замовлення. На все добре!")
        else:
            print("Ви не замовили жодного продукта.")

    #Початкові дані:
    products = [
        {
        "Nome":'Viagra',
        "principio_attivo":'Sildenafil',
        "prezzo":5
        },
        {
        "Nome":'Cialis',
        "principio_attivo":'Tadalafil',
        "prezzo":4
        },
        {
        "Nome":'Levitra',
        "principio_attivo":'Vardenafil',
        "prezzo":3
        },
        {
        "Nome":'Priligy',
        "principio_attivo":'Dapoxetin',
        "prezzo":2
        },
        {
        "Nome": 'Clomid',
        "principio_attivo":'Clomifen',
        "prezzo":1
        }
        ]

    balance = 1000
    shopping_cart = []

    #Ознайомлюєм користувача з асортиментом(Меню)
    print(products)



    # Цикл який дозволяє працювати, доки є гроші на балансі
    while balance > 0:
        prodotto = input("Введіть назву продукта (або вийдіть, натиснувши Enter): ").strip()
        if not prodotto:
            break
        quantita = int(input("Введіть потрібну кількість:"))

        #Пошук товару із ассортименту
        cerca_prodotto = next((product for product in products if product["Nome"].lower() == prodotto.lower()), None)
        if cerca_prodotto:
            totale = cerca_prodotto["prezzo"] * quantita
            if totale > balance:
                print("Недостатньо коштів на рахунку")
            else:
                order = {
                    "Nome": cerca_prodotto["Nome"],
                    "Costo per unità": cerca_prodotto["prezzo"],
                    "Quantita": quantita,
                    "Totale": totale
                }
                balance -= totale
                shopping_cart.append(order)
                print(f"Товар додано до кошика: {quantita} одиниць {prodotto}.")
                print(f"Ваш залишок = {balance}")

        # Запит користувача щодо продовження покупок
        continue_shopping = input("Бажаєте продовжити покупки? (так/ні): ").strip().lower()
        if continue_shopping != 'так':
            print_order(shopping_cart)
            break
        else:
            continue
    else:
        print_order(shopping_cart)









